# 주석

'''
작성자 : 라이언
작성일자 : 21-07-21
'''

#출력 함수
print('Hello, World!')   # 메모(주석)

# print 함수(표준출력)

print('안녕') # 문자는 앞뒤로 작은 따옴표('') 또는 큰 따옴표("")를 넣는다.

print(1)    # 숫자는 따옴표를 넣지 않는다.
print(2)   
print(3)
print() # 빈 줄 삽입 : 파이썬의 print 함수는 기본적으로 엔터를 포함한다.

print(1, 2, 3)  # 쉼표(콤마)는 실행 시 스페이스(공백) 기능을 한다.
print('안녕', '하세요')
print()

print(1, 2, 3, sep = ', ') # 출력 시 사이사이에 콤마(,) 구현
print(4, 5, 6, sep=' : ')   # 출력 시 사이사이에 콜론(:) 구현
print()

print(7, end = '')  # 엔터 기능을 없앤다.
print(8, end = '                ')  # 엔터 기능 대신 공백 글자(스페이스)를 넣는다.
print(9)
print(10)

